Documents/УправлениеТарифами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеТарифами</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТарифыУслугПодробно</xr:Item>
				<xr:Item>InformationRegister.Тарифы</xr:Item>
				<xr:Item>InformationRegister.ТарифыПороговые</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаПоНормеЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыУслугПодробно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаПодробно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифаЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифыПороговые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСтимулирующегоТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТарифыПороговые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТарифыПороговые</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтимулирующегоТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеТарифами/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Тарифы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидТарифа) Тогда
			СтрокаТабличнойЧасти.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого СтрокаТабличнойЧасти Из ТарифыПороговые Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидТарифа) Тогда
			СтрокаТабличнойЧасти.ВидТарифа = Перечисления.ВидыТарифов.Общий;
		КонецЕсли;	
	КонецЦикла;	
	
	ТаблицаПроверки = ПроверкаУслугиПороговой();
	
	Если ТаблицаПроверки.Количество() > 0 Тогда
		
		ТекстСообщения = НСтр("ru='Изменены значения пороговых тарифов.';uk='Змінено значення порогових тарифів.'");
		
		ОСМДСервер.СообщитьОбОшибке(
			ТекстСообщения,
			ЭтотОбъект,
			Отказ
		);
		
	КонецЕсли; 	
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.УправлениеТарифами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьТарифы(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьТарифыУслугПодробно(ДополнительныеСвойства, Движения, Отказ);
	Если ПроверкаПервойзаписиУслугиПороговой() Тогда
		ПроведениеСервер.ОтразитьТарифыПороговые(ДополнительныеСвойства, Движения, Отказ);
	Иначе
		ПроведениеСервер.ОтразитьТарифыПороговые(ДополнительныеСвойства, Движения, Истина);
	КонецЕсли;
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Функция ПроверкаУслугиПороговой()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УправлениеТарифами.Услуга,
		|	УправлениеТарифами.ЗначениеСтимулирующегоТарифа,
		|	УправлениеТарифами.Порог,
		|	УправлениеТарифами.ЗначениеПорога,
		|	УправлениеТарифами.ЗначениеТарифа
		|ПОМЕСТИТЬ втУправлениеТарифами
		|ИЗ
		|	&УправлениеТарифами КАК УправлениеТарифами
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТарифыПороговые.Порог,
		|	ТарифыПороговые.ЗначениеТарифа,
		|	ТарифыПороговые.ЗначениеПорога,
		|	ТарифыПороговые.ЗначениеСтимулирующегоТарифа,
		|	ТарифыПороговые.Услуга,
		|	втУправлениеТарифами.ЗначениеТарифа КАК ЗначениеТарифа1,
		|	втУправлениеТарифами.ЗначениеПорога КАК ЗначениеПорога1,
		|	втУправлениеТарифами.ЗначениеСтимулирующегоТарифа КАК ЗначениеСтимулирующегоТарифа1,
		|	втУправлениеТарифами.Услуга КАК Услуга1
		|ИЗ
		|	РегистрСведений.ТарифыПороговые КАК ТарифыПороговые
		|		ПОЛНОЕ СОЕДИНЕНИЕ втУправлениеТарифами КАК втУправлениеТарифами
		|		ПО ТарифыПороговые.Услуга = втУправлениеТарифами.Услуга
		|			И ТарифыПороговые.Порог = втУправлениеТарифами.Порог
		|			И (ТарифыПороговые.ЗначениеТарифа <> втУправлениеТарифами.ЗначениеТарифа
		|				ИЛИ ТарифыПороговые.ЗначениеПорога <> втУправлениеТарифами.ЗначениеПорога
		|				ИЛИ ВЫБОР
		|					КОГДА &ИспользоватьСтимулирующийТариф
		|						ТОГДА ТарифыПороговые.ЗначениеСтимулирующегоТарифа <> втУправлениеТарифами.ЗначениеСтимулирующегоТарифа
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)
		|ГДЕ
		|	ТарифыПороговые.Период = &Период
		|	И ТарифыПороговые.Здание = &Здание
		|	И ТарифыПороговые.Регистратор <> &Ссылка
		|	И НЕ втУправлениеТарифами.Услуга ЕСТЬ NULL ";
		
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));	
	Запрос.УстановитьПараметр("Здание", Здание);	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("ИспользоватьСтимулирующийТариф", ПолучитьФункциональнуюОпцию("ИспользоватьСтимулирующийТариф"));	
	Запрос.УстановитьПараметр("УправлениеТарифами", ТарифыПороговые.Выгрузить());	
	
	ТаблицаПроверки = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПроверки;
	
КонецФункции

Функция ПроверкаПервойзаписиУслугиПороговой()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыПороговые.Порог,
		|	ТарифыПороговые.ЗначениеТарифа,
		|	ТарифыПороговые.ЗначениеПорога,
		|	ТарифыПороговые.ЗначениеСтимулирующегоТарифа,
		|	ТарифыПороговые.Услуга
		|ИЗ
		|	РегистрСведений.ТарифыПороговые КАК ТарифыПороговые
		|ГДЕ
		|	ТарифыПороговые.Период = &Период
		|	И ТарифыПороговые.Здание = &Здание
		|	И ТарифыПороговые.Регистратор <> &Ссылка";
		
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Дата));	
	Запрос.УстановитьПараметр("Здание", Здание);	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции
